dict_a1 = {}
dict_a1['Название'] = input('Укажите название товара:  ')
dict_a1['Цена'] = input('Укажите цену:  ')
dict_a1['Количество'] = input('Укажите количество:  ')
dict_a1['Ед_изм'] = input('Укажите единицу измерения:  ')
print(dict_a1)
dict_a2 = {}
dict_a2['Название'] = input('Укажите название товара:  ')
dict_a2['Цена'] = input('Укажите цену:  ')
dict_a2['Количество'] = input('Укажите количество:  ')
dict_a2['Ед_изм'] = input('Укажите единицу измерения:  ')
print(dict_a2)
dict_a3 = {}
dict_a3['Название'] = input('Укажите название товара:  ')
dict_a3['Цена'] = input('Укажите цену:  ')
dict_a3['Количество'] = input('Укажите количество:  ')
dict_a3['Ед_изм'] = input('Укажите единицу измерения:  ')
print(dict_a3)

#кажется, я не понял сути задания и сделал не то. Это как о слишком просто для 6-й задачи

dict_b1 ={}
dict_b1['Название'] = [dict_a1['Название'], dict_a2['Название'], dict_a3['Название']]
dict_b1['Цена'] = [dict_a1['Цена'], dict_a2['Цена'], dict_a3['Цена']]
dict_b1['Количество'] = [dict_a1['Количество'], dict_a2['Количество'], dict_a3['Количество']]
dict_b1['Ед_изм'] = [dict_a1['Ед_изм'], dict_a2['Ед_изм'], dict_a3['Ед_изм']]
print('Строка сортировки:   ')
print(dict_b1)